In [1]:
import numpy as np
import pandas as pd

## Selecting Data from `DataFrame` Objects

Similiarly to what we found with `Series` objects. You can interact with `DataFrame` objects in ways that sometimes resemble a dictionary and other times a NumPy array.

In [2]:
college_scorecard = pd.read_csv(
    './data/college-scorecard-data-scrubbed.csv', 
    encoding='latin-1',
    index_col = 'institution_name')
college_scorecard.head()

,UNITID,OPEID,OPEID6,city,state,url,predominant_degree_code,predominant_degree_desc,institutional_owner_code,institutional_owner_desc,...,pell_grant_receipents,full_time_retention_rate_4_year,full_time_retention_rate_less_than_4_year,part_time_rentention_rate_4_year,part_time_rentention_rate_less_than_4_year,students_with_federal_loans,median_student_earnings,median_student_debt,less_than_4_year_school_completion_rate,4_year_school_completion_rate
institution_name,,,,,,,,,,,,,,,,,,,,,
Alaska Bible College,102580,884300,8843,Palmer,AK,www.akbible.edu/,3,Bachelors,2,PrivateNonProfit,...,0.3571,0.3333,NaN,NaN,NaN,0.2857,NaN,PrivacySuppressed,NaN,NaN
Alaska Career College,103501,2541000,25410,Anchorage,AK,www.alaskacareercollege.edu,1,Certificate,3,PrivateForProfit,...,0.7078,NaN,0.7941,NaN,NaN,0.7860,28700,8994,0.707589494,NaN
Alaska Christian College,442523,4138600,41386,Soldotna,AK,www.alaskacc.edu,1,Certificate,2,PrivateNonProfit,...,0.8868,NaN,0.4737,NaN,1.0,0.6792,NaN,PrivacySuppressed,0,NaN
Alaska Pacific University,102669,106100,1061,Anchorage,AK,www.alaskapacific.edu,3,Bachelors,2,PrivateNonProfit,...,0.3152,0.7742,NaN,1.0,NaN,0.5297,47000,23250,NaN,0.514833663
AVTEC-Alaska's Institute of Technology,102711,3160300,31603,Seward,AK,www.avtec.edu/,1,Certificate,1,Public,...,0.0737,NaN,1.0000,NaN,1.0,0.0664,33500,PrivacySuppressed,0.846055789,NaN

### Masking

Masking operations likewise return rows from a `DataFrame`, but the **criteria of the masks will be a comparison on one of the columns/Series**. This is somewhat confusing sounding, so let's just demonstrate:

In [3]:
college_scorecard['state'] == 'AK'

institution_name
Alaska Bible College                       True
Alaska Career College                      True
Alaska Christian College                   True
Alaska Pacific University                  True
AVTEC-Alaska's Institute of Technology     True
                                          ...
Northwest College                         False
Sheridan College                          False
University of Wyoming                     False
Western Wyoming Community College         False
Wyotech-Laramie                           False
Name: state, Length: 7282, dtype: bool

In [ ]:
# Return all rows where the 'state' Series has a value of 'AK'
college_scorecard[ college_scorecard['state'] == 'AK']

In [ ]:
# Which colleges in IN offer Bachelors degrees?
# Again, notice the parathesis here
# Also, notice that I'm assigning it to a variable so that I can use it later
colleges_IN_Bachelors = college_scorecard[
    (college_scorecard['state'] == 'IN') & 
    (college_scorecard['predominant_degree_desc'] == 'Bachelors')
    ]

**NOTE**: You can break down the right hand side of the assignment into two lines for readability of the code.

In [ ]:
colleges_IN_Bachelors

In [ ]:
# how many colleges met the criteria?
print(len(colleges_IN_Bachelors))
colleges_IN_Bachelors.shape[0]

### Selecting Multiple Columns of DataFrame

In [ ]:
two_columns = college_scorecard[ ['state', 'predominant_degree_desc'] ]
two_columns.head()

**NOTE**: Among the two sets of square brackets `[[ ]]`, the first set is used to select the columns, the second set is used to list the columns you want to select.

# Handling Missing Data

In [ ]:
none_val = None
print(type(none_val))
print(none_val is None)

In [ ]:
none_val*5

In [ ]:
# what is this included None?
vals1 = np.array([1, 3, None, 4])
vals1*5

In [ ]:
vals1

In [ ]:
np.sum(vals1)

### NaN: Missing numerical data

NaN stands for Not-a-Number

In [ ]:
vals1 = np.array([1, np.nan, 3, 4])
vals1*5

In [ ]:
vals1

In [ ]:
vals1.dtype

In [ ]:
np.sum(vals1)

**Sum of any true number and a nan is a nan**

### np.nansum

Used to treat nan as a zero in adding the elements of the array

In [ ]:
np.nansum(vals1)

In [ ]:
# lots of nan related functions...
np.nanmedian(vals1)

### NaN and None in pandas

Pandas converts both NaN and None as NaN

In [ ]:
simple_series = pd.Series([1,np.nan, 2, None])

In [ ]:
simple_series

In [ ]:
print("sums up total:  ", simple_series.sum())
print("averages of existing numbers:  ", simple_series.mean())

## Operating on Null Values

The following functions help in detecting and handling the null values in Pandas package

| Ufunc for missing values              | Description |                         
|---------------------|----------------------------------------------------------|
|``isnull()``          |Generate a Boolean mask indicating missing values         |
|``notnull()``      |Opposite of isnull()                                      |
|``dropna()``           |Return a filtered version of the data                     |
|``fillna()``         |Return a copy of the data with missing values filled      |

In [ ]:
simple_data = pd.Series([1,np.nan, 'Hello', None])
simple_data

In [ ]:
simple_data.isnull()

In [ ]:
~simple_data.isnull()

In [ ]:
simple_data[ ~simple_data.isnull() ]

In [ ]:
simple_data[simple_data.notnull()]

In [ ]:
simple_data

In [ ]:
simple_data.dropna()

In [ ]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,    6]])

df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

<div class="alert alert-block alert-info">
<p>
There are other optional parameters that are offered by the ``dropna()`` function on dataframe, like, ``how`` and ``thresh``. **Look at Page 126 of the textbook for more details.** </p>
</div>

In [ ]:
df

In [ ]:
df.fillna(100)

In [ ]:
df

In [ ]:
df = df.fillna(100)

In [ ]:
df

<div class="alert alert-block alert-info">
<p>
There are other optional parameter called method that are offered by the ``fillna()`` function on dataframe, like, ``method='ffill'`` and ``method='bfill'``. **Look at Page 127 of the textbook for more details.** </p>

<p>
**Also, read other important keyword argument ``inplace``. What happens when it is set to `False` and `True`? **
</p>
</div>

## Working with dataset with missing values

Marketing dataset: This dataset contains questions from questionaries that were filled out by shopping mall customers in the San Francisco Bay area. The goal is to predict the Anual Income of Household from the other 13 demographics attributes. [Source](http://sci2s.ugr.es/keel/dataset.php?cod=163)

[Data Dictionary](http://sci2s.ugr.es/keel/dataset/data/classification/marketing-names.txt)

In [4]:
mark_data = pd.read_csv('./data/marketing.csv')

In [5]:
mark_data.head(15)

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
0,2,1.0,5,4.0,5.0,5.0,3,3.0,0,1.0,1.0,7.0,NaN,9
1,1,1.0,5,5.0,5.0,5.0,3,5.0,2,1.0,1.0,7.0,1.0,9
2,2,1.0,3,5.0,1.0,5.0,2,3.0,1,2.0,3.0,7.0,1.0,9
3,2,5.0,1,2.0,6.0,5.0,1,4.0,2,3.0,1.0,7.0,1.0,1
4,2,5.0,1,2.0,6.0,3.0,1,4.0,2,3.0,1.0,7.0,1.0,1
5,1,1.0,6,4.0,8.0,5.0,3,2.0,0,1.0,1.0,7.0,1.0,8
6,1,5.0,2,3.0,9.0,4.0,1,3.0,1,2.0,3.0,7.0,1.0,1
7,1,3.0,3,4.0,3.0,5.0,1,1.0,0,2.0,3.0,7.0,1.0,6
8,1,1.0,6,3.0,8.0,5.0,3,3.0,0,2.0,3.0,7.0,1.0,2
9,1,1.0,7,4.0,8.0,4.0,3,2.0,0,2.0,3.0,7.0,1.0,4
10,1,5.0,2,4.0,9.0,5.0,1,1.0,0,2.0,3.0,7.0,1.0,1
11,2,2.0,2,3.0,2.0,5.0,1,2.0,0,1.0,1.0,5.0,1.0,4
12,2,1.0,3,6.0,6.0,2.0,2,4.0,2,1.0,1.0,7.0,1.0,8
13,2,1.0,5,3.0,5.0,5.0,3,4.0,0,2.0,1.0,7.0,1.0,7
14,1,4.0,6,3.0,NaN,5.0,1,1.0,0,1.0,1.0,7.0,NaN,4

In [7]:
mark_data[ ['YearsInSf', 'Language']]

      YearsInSf  Language
0           5.0       NaN
1           5.0       1.0
2           5.0       1.0
3           5.0       1.0
4           3.0       1.0
...         ...       ...
8988        5.0       1.0
8989        5.0       1.0
8990        5.0       1.0
8991        5.0       1.0
8992        5.0       1.0

[8993 rows x 2 columns]

In [8]:
mark_data[ ['YearsInSf', 'Language']].isnull()

      YearsInSf  Language
0         False      True
1         False     False
2         False     False
3         False     False
4         False     False
...         ...       ...
8988      False     False
8989      False     False
8990      False     False
8991      False     False
8992      False     False

[8993 rows x 2 columns]

In [11]:
mark_data.isnull()

,Sex,MaritalStatus,Age,Education,Occupation,YearsInSf,DualIncome,HouseholdMembers,Under18,HouseholdStatus,TypeOfHome,EthnicClass,Language,Income
0,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8988,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8989,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8990,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8991,False,False,False,False,False,False,False,False,False,False,False,False,False,False
8992,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [12]:
mark_data[ ['YearsInSf', 'Language']].isnull().sum()

YearsInSf    913
Language     359
dtype: int64

In [ ]:
mark_data.sample(15)
print(mark_data.shape)
dropped_df = mark_data.dropna()
print(dropped_df.shape)

### Activity:

* How many total responders in the dataset?


* How many missing values for each attribute (column) in the dataset?



* Which attribute has the most missing values in the dataset? (**Hint**: To get the index of the maximum element you can use [`idxmax()`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.idxmax.html) function)


* How do you fill the missing values with a `0`?


* **Most Common Use**: Can you fill each missing value with the corresponding average for that attribute? 
    * For example, if 'Education' attribute is missing for a person, can you find the average 'Education' of all people and fill that missing 'Age' with that average. See if you can figure out how you would do that.

## Activity

In [ ]:
mark_data = pd.read_csv('./data/marketing.csv')

In [ ]:
mark_data.head()

* How many elements of Occupation are missing? Default all the missing values for Occupation to `1`. Write a line of code that verifies there is no more missing data.

* Drop all the cols with missing data into a new data frame

* Drop all the rows with missing data  into a new data frame